src/Reports/ОтчетПоДополнительнымРаботам/ОтчетПоДополнительнымРаботам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоДополнительнымРаботам</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ДополнительныеРаботы/ДополнительныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеРаботы</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выходной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыТО/НормыТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыТО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МашинноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаНастройку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаОбдув</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ОтчетПоДополнительнымРаботам/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	Макет = ОбъектЗн.ПолучитьМакет("МакетДляДокумента");
	Иначе
	Макет = ОбъектЗн.ПолучитьМакет("Макет");
	КонецЕсли;

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблИсполнитель = Макет.ПолучитьОбласть("Исполнитель");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблИсполнительИтого = Макет.ПолучитьОбласть("ИсполнительИтого");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.Подразделение = Отчет.Подразделение;
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРаботы.Сотрудник КАК Сотрудник,
	|	ДополнительныеРаботы.ТехОперация КАК ТехОперация,
	|	ДополнительныеРаботы.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.ДополнительныеРаботы КАК ДополнительныеРаботы
	|ГДЕ
	|	ДополнительныеРаботы.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И ДополнительныеРаботы.Подразделение = &Подразделение"; 
Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Отчет.Период.ДатаОкончания));
Запрос.УстановитьПараметр("Подразделение", Отчет.Подразделение);
	Если СписокИсполнителей.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ДополнительныеРаботы.Сотрудник В(&СписокИсполнителей)";
	Запрос.УстановитьПараметр("СписокИсполнителей", СписокИсполнителей);	
	КонецЕсли;
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО
								|	Сотрудник,ТехОперация
								|ИТОГИ
								|	СУММА(Количество)
								|ПО
								|	Сотрудник,ТехОперация"; 
РезультатЗапроса = Запрос.Выполнить();
ВыборкаСотрудник = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
ВсегоДР = 0;
ВсегоОД = 0;
	Пока ВыборкаСотрудник.Следующий() Цикл
	ИтогоДР = 0;
	ИтогоОД = 0;
	ОблИсполнитель.Параметры.ФИО = СокрЛП(ВыборкаСотрудник.Сотрудник.Наименование);
	ОблИсполнитель.Параметры.Исполнитель = ВыборкаСотрудник.Сотрудник;
	ТабДок.Вывести(ОблИсполнитель);
	ВыборкаТО = ВыборкаСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТО.Следующий() Цикл
		СуммаДР = 0;
		СуммаОД = 0;
		ОблСтрока.Параметры.ТехОперация = ВыборкаТО.ТехОперация;
		Выборка = ВыборкаТО.Выбрать();
			Пока Выборка.Следующий() Цикл
			НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.Период.ДатаОкончания,Новый Структура("ТехОперация",ВыборкаТО.ТехОперация));
			Стоимость = Выборка.Количество/НормыТО.Норма*НормыТО.Стоимость*Выборка.Сотрудник.Должность.КоэффициентРазряда;
				Если ВыборкаТО.ТехОперация.ДополнительныеРаботы Тогда
				СуммаДР = СуммаДР + Стоимость;
				ИтогоДР = ИтогоДР + Стоимость;
				ВсегоДР = ВсегоДР + Стоимость;
				Иначе
				СуммаОД = СуммаОД + Стоимость;	
				ИтогоОД = ИтогоОД + Стоимость;
				ВсегоОД = ВсегоОД + Стоимость;
				КонецЕсли; 	
			КонецЦикла;
		ОблСтрока.Параметры.СуммаДР = СуммаДР;
		ОблСтрока.Параметры.СуммаОД = СуммаОД;
		ТабДок.Вывести(ОблСтрока);
		КонецЦикла;
	ОблИсполнительИтого.Параметры.ИтогоДР = ИтогоДР;
	ОблИсполнительИтого.Параметры.ИтогоОД = ИтогоОД;
	ТабДок.Вывести(ОблИсполнительИтого);
	КонецЦикла;
ОблКонец.Параметры.ВсегоДР = ВсегоДР; 
ОблКонец.Параметры.ВсегоОД = ВсегоОД;
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	ОблКонец.Параметры.Мастер = ЭтаФорма.Параметры.Документ.Автор;
	ОблКонец.Параметры.НачальникПЭО = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Начальник ПЭО");
	КонецЕсли;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3; 
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура НастроитьПараметрыОтчета(Документ)
Отчет.Период.ДатаНачала = НачалоМесяца(Документ.Дата);			
Отчет.Период.ДатаОкончания = КонецМесяца(Документ.Дата);
Отчет.Подразделение = Документ.Подразделение;
СписокИсполнителей.Очистить();
	Для каждого ТЧ Из Документ.ТабличнаяЧасть Цикл
	СписокИсполнителей.Добавить(ТЧ.Исполнитель);	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	НастроитьПараметрыОтчета(ЭтаФорма.Параметры.Документ);		
	Сформировать(Неопределено);   	
	КонецЕсли; 
КонецПроцедуры
